app/controllers/craftsmen_products_controller.rb

  def index
    @craftsmen_products = CraftsmenProduct.order('updated_at DESC').all
---
SELECT `craftsmen_products`.* FROM `craftsmen_products` ORDER BY updated_at DESC