app/controllers/home_controller.rb

  def index
    @craftsmen = Craftsman.order('profile_en DESC, id DESC').limit(12)
    @japan_styles = JapanStyle.order('created_at DESC').limit(12)
---
SELECT `japan_styles`.* FROM `japan_styles` ORDER BY created_at DESC LIMIT 12